couetteFlow/Re-1000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
Lcanal 0.1;
hCanal 0.1;
zCanal 0.01;
nL	60;
nH	60;

vertices
(
    (0 		0   	0)
    ($Lcanal 	0   	0)
    ($Lcanal 	$hCanal 0)
    (0 		$hCanal 0)
    (0 		0   	$zCanal)
    ($Lcanal 	0   	$zCanal)
    ($Lcanal 	$hCanal $zCanal)
    (0 		$hCanal $zCanal)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nL $nH 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    in
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    out
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    tWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
